Repository: pablitxn/llm-token-price
Catalog: services/backend/LlmTokenPrice.Application/Resources/ValidationMessages.*.resx
Languages: es

# ModelNameRequired
source: Model name is required
es: El nombre del modelo es obligatorio

# ModelNameMaxLength
source: Model name cannot exceed 255 characters
es: El nombre del modelo no puede exceder 255 caracteres

# ProviderRequired
source: Provider is required
es: El proveedor es obligatorio

# ProviderMaxLength
source: Provider cannot exceed 100 characters
es: El proveedor no puede exceder 100 caracteres

# VersionMaxLength
source: Version cannot exceed 50 characters
es: La versión no puede exceder 50 caracteres

# InputPriceGreaterThanZero
source: Input price must be greater than 0
es: El precio de entrada debe ser mayor que 0

# InputPriceDecimalPlaces
source: Input price can have maximum 6 decimal places
es: El precio de entrada puede tener un máximo de 6 decimales

# OutputPriceGreaterThanZero
source: Output price must be greater than 0
es: El precio de salida debe ser mayor que 0

# OutputPriceDecimalPlaces
source: Output price can have maximum 6 decimal places
es: El precio de salida puede tener un máximo de 6 decimales

# CurrencyRequired
source: Currency is required
es: La moneda es obligatoria

# CurrencyInvalid
source: Currency must be one of: {0}
es: La moneda debe ser una de: {0}

# StatusRequired
source: Status is required
es: El estado es obligatorio

# StatusInvalid
source: Status must be one of: {0}
es: El estado debe ser uno de: {0}

# PricingValidFromBeforeValidTo
source: Pricing Valid From must be before Pricing Valid To
es: La fecha de validez inicial debe ser anterior a la fecha final

# CapabilitiesRequired
source: Capabilities are required
es: Las capacidades son obligatorias

# BenchmarkNameRequired
source: Benchmark name is required
es: El nombre del benchmark es obligatorio

# BenchmarkNameMaxLength
source: Benchmark name cannot exceed 50 characters
es: El nombre del benchmark no puede exceder 50 caracteres

# BenchmarkNameFormat
source: Benchmark name can only contain letters, numbers, and underscores
es: El nombre del benchmark solo puede contener letras, números y guiones bajos

# FullNameRequired
source: Full name is required
es: El nombre completo es obligatorio

# FullNameMaxLength
source: Full name cannot exceed 255 characters
es: El nombre completo no puede exceder 255 caracteres

# DescriptionMaxLength
source: Description cannot exceed 1000 characters
es: La descripción no puede exceder 1000 caracteres

# CategoryRequired
source: Category is required
es: La categoría es obligatoria

# CategoryInvalid
source: Category must be one of: {0}
es: La categoría debe ser una de: {0}

# InterpretationRequired
source: Interpretation is required
es: La interpretación es obligatoria

# InterpretationInvalid
source: Interpretation must be one of: {0}
es: La interpretación debe ser una de: {0}

# TypicalRangeMinRequired
source: Typical range minimum is required
es: El rango mínimo típico es obligatorio

# TypicalRangeMaxRequired
source: Typical range maximum is required
es: El rango máximo típico es obligatorio

# TypicalRangeMinLessThanMax
source: Typical range minimum must be less than maximum
es: El rango mínimo típico debe ser menor que el máximo

# QapsWeightRequired
source: QAPS weight is required
es: El peso QAPS es obligatorio

# QapsWeightRange
source: QAPS weight must be between 0.00 and 1.00
es: El peso QAPS debe estar entre 0.00 y 1.00

# QapsWeightDecimalPlaces
source: QAPS weight can have maximum 2 decimal places
es: El peso QAPS puede tener un máximo de 2 decimales

# ContextWindowMinimum
source: Context window must be at least {0:N0} tokens
es: La ventana de contexto debe ser de al menos {0:N0} tokens

# ContextWindowMaximum
source: Context window cannot exceed {0:N0} tokens
es: La ventana de contexto no puede exceder {0:N0} tokens

# MaxOutputTokensGreaterThanZero
source: Max output tokens must be greater than 0
es: Los tokens máximos de salida deben ser mayores que 0

# MaxOutputTokensExceedsContextWindow
source: Max output tokens cannot exceed context window
es: Los tokens máximos de salida no pueden exceder la ventana de contexto

# BenchmarkRequired
source: Benchmark is required
es: El benchmark es obligatorio

# ScoreRequired
source: Score is required
es: La puntuación es obligatoria

# ScoreExceedsMaxScore
source: Score cannot exceed max score
es: La puntuación no puede exceder la puntuación máxima

# SourceUrlInvalidFormat
source: Source URL must be a valid URL format
es: La URL de origen debe tener un formato válido

# NotesMaxLength
source: Notes cannot exceed 500 characters
es: Las notas no pueden exceder 500 caracteres
